combat_unit = [  # 18种
    48,  # 枪兵
    55,  # 女妖
    57,  # 大和
    692,  # 飓风
    50,  # 幽灵
    53,  # 饿火
    484,  # 恶蝠
    689,  # 解放者
    48,  # 陆战队
    54,  # 医疗机
    56,  # 铁鸦
    49,  # 收割者
    33,  # 攻城坦克
    32,  # 攻城坦克
    52,  # 雷神
    691,  # 雷神
    34,  # 维京机器人
    35  # 维京战机
]

building = [  # 28种
    29,  # 军械库
    21,  # 兵营
    46,  # 飞行的兵营
    38,  # 重定向兵营
    37,  # 兵营实验室
    24,  # #碉堡
    18,  # 指挥中心
    36,  # 飞行的指挥中心
    22,  # 工程湾
    27,  # 工厂
    43,  # 飞起来的工厂
    40,  # 工厂重定向
    39,  # 工厂实验室
    30,  # 聚变芯体
    26,  # 幽灵军校
    23,  # 导弹塔
    132,  # 轨道指挥中心
    134,  # 飞行的指挥中心
    130,  # 行星要塞
    6,  # 反应堆
    25,  # 感应塔
    28,  # 星港
    44,  # 星港飞起来
    42,  # 星港重定向
    41,  # 星港实验室
    19,  # 补给站
    47,  # 补给站下
    5,  # 科技实验室
]
